In [20]:
import pandas as pd
import numpy as np

In [2]:
human = pd.read_csv(r'C:\Users\USER\Desktop\portfolio\working_Human_Res.csv')

In [3]:
human.head()

,id,first_name,last_name,birthdate,gender,race,department,jobtitle,location,hire_date,termdate,city,state
0,37846,Kimmy,Walczynski,1991-06-04,Male,Hispanic or Latino,Engineering,Programmer Analyst I,Headquarters,2002-01-20,NaN,Cleveland,Ohio
1,41533,Ignatius,Springett,1984-06-29,Male,White,Business Development,Business Analyst,Headquarters,2019-04-08,NaN,Cleveland,Ohio
2,45747,Corbie,Bittlestone,1989-07-29,Male,Black or African American,Sales,Solutions Engineer Manager,Headquarters,2010-10-12,NaN,Cleveland,Ohio
3,55274,Baxy,Matton,1982-09-14,Female,White,Services,Service Tech,Headquarters,2005-04-10,NaN,Cleveland,Ohio
4,76100,Terrell,Suff,1994-04-11,Female,Two or More Races,Product Management,Business Analyst,Remote,2010-09-29,2029-10-29 06:09:38 UTC,Flint,Michigan

In [4]:
human.shape

(22214, 13)

In [5]:
human.duplicated().sum()

0

#### Employee locations

In [6]:
human['location'].value_counts()

location
Headquarters    16715
Remote           5499
Name: count, dtype: int64

#### Number of Employee

In [7]:
human['id'].nunique()

22214

#### Number of Department

In [8]:
human['department'].nunique()

13

#### Number of Employees with termination date

In [9]:
human['termdate'].nunique()

3929

In [10]:
human.nunique()

id            22214
first_name     7758
last_name     17754
birthdate     10854
gender            3
race              7
department       13
jobtitle        185
location          2
hire_date      7016
termdate       3929
city             77
state             7
dtype: int64

#### Number of Employees By Department

In [11]:
human['department'].value_counts()

department
Engineering                 6686
Accounting                  3333
Sales                       1832
Human Resources             1807
Training                    1692
Services                    1686
Business Development        1642
Research and Development    1084
Support                      954
Product Management           641
Marketing                    494
Legal                        311
Auditing                      52
Name: count, dtype: int64

#### Number of Employees per State

In [12]:
human['state'].value_counts()

state
Ohio            18025
Pennsylvania     1115
Illinois          868
Indiana           700
Michigan          673
Kentucky          451
Wisconsin         382
Name: count, dtype: int64

#### Number of Employees per Race

In [13]:
human['race'].value_counts()

race
White                                        6328
Two or More Races                            3648
Black or African American                    3619
Asian                                        3562
Hispanic or Latino                           2501
American Indian or Alaska Native             1327
Native Hawaiian or Other Pacific Islander    1229
Name: count, dtype: int64

In [14]:
human.head(2)

,id,first_name,last_name,birthdate,gender,race,department,jobtitle,location,hire_date,termdate,city,state
0,37846,Kimmy,Walczynski,1991-06-04,Male,Hispanic or Latino,Engineering,Programmer Analyst I,Headquarters,2002-01-20,NaN,Cleveland,Ohio
1,41533,Ignatius,Springett,1984-06-29,Male,White,Business Development,Business Analyst,Headquarters,2019-04-08,NaN,Cleveland,Ohio

#### The following codes perform same function of filtring

In [19]:
human.groupby('location').get_group('Headquarters')

,id,first_name,last_name,birthdate,gender,race,department,jobtitle,location,hire_date,termdate,city,state
0,37846,Kimmy,Walczynski,1991-06-04,Male,Hispanic or Latino,Engineering,Programmer Analyst I,Headquarters,2002-01-20,NaN,Cleveland,Ohio
1,41533,Ignatius,Springett,1984-06-29,Male,White,Business Development,Business Analyst,Headquarters,2019-04-08,NaN,Cleveland,Ohio
2,45747,Corbie,Bittlestone,1989-07-29,Male,Black or African American,Sales,Solutions Engineer Manager,Headquarters,2010-10-12,NaN,Cleveland,Ohio
3,55274,Baxy,Matton,1982-09-14,Female,White,Services,Service Tech,Headquarters,2005-04-10,NaN,Cleveland,Ohio
5,116166,Kacie,Offiler,1971-01-18,Male,Asian,Engineering,Developer III,Headquarters,2018-09-01,NaN,Cleveland,Ohio
...,...,...,...,...,...,...,...,...,...,...,...,...,...
22208,999610988,Hillie,Renbold,1965-10-30,Female,Two or More Races,Engineering,Web Developer II,Headquarters,2001-12-03,NaN,Cleveland,Ohio
22209,999797418,Dorella,Garvan,1998-07-08,Female,Hispanic or Latino,Research and Development,Research Assistant I,Headquarters,2012-02-08,NaN,Cleveland,Ohio
22210,999869877,Dasie,Thorsby,2001-04-19,Female,Two or More Races,Services,Service Manager,Headquarters,2017-10-06,NaN,Cleveland,Ohio
22211,999919822,Nerty,Wilding,1970-02-09,Female,Two or More Races,Training,Junior Trainer,Headquarters,2001-02-08,NaN,Cleveland,Ohio
22212,999960380,Mabelle,Dawks,1985-09-02,Male,Two or More Races,Accounting,Staff Accountant I,Headquarters,2005-04-03,2012-12-10 14:29:59 UTC,Cleveland,Ohio

In [16]:
#human[human.location == 'Headquarters']

In [17]:
#human[human['location']== 'Headquarters']

In [18]:
#human[human['location'].str.contains('Headquarters')]